app/Models/ModelKonfirmasi.php

SELECT *
FROM `konfirmasi`
JOIN `users` ON `users`.`id` = `konfirmasi`.`userid`
---
  public function getAll()
  {
    $builder = $this->db->table('konfirmasi');
    $builder->select('*');
    $builder->join('users', 'users.id = konfirmasi.userid');
    $query = $builder->get();