app/Models/ModelAbsensi.php

    public function getPresenceToday()
    {
        $builder = $this->db->table('absensi');
        $builder->select('*');
        $builder->join('users', 'users.id = absensi.userid');
        $builder->where('tanggal', date('Y-m-d'));
        $builder->where('absensi.status !=', 'Kosong');
        $builder->where('absensi.status !=', 'Izin');
        $builder->where('jabatan !=', 'Marketing');
        $query = $builder->get();
---
SELECT *
FROM `absensi`
JOIN `users` ON `users`.`id` = `absensi`.`userid`
WHERE `tanggal` = '2022-11-08'
AND `absensi`.`status` != 'Kosong'
AND `absensi`.`status` != 'Izin'
AND `jabatan` != 'Marketing'

    public function getLateToday()
    {
        $builder = $this->db->table('absensi');
        $builder->select('*');
        $builder->join('users', 'users.id = absensi.userid');
        $builder->where('tanggal', date('Y-m-d'));
        $builder->where('absensi.status', 'Terlambat');
        $builder->where('jabatan !=', 'Marketing');
        $query = $builder->get();
---
SELECT *
FROM `absensi`
JOIN `users` ON `users`.`id` = `absensi`.`userid`
WHERE `tanggal` = '2022-11-08'
AND `absensi`.`status` = 'Terlambat'
AND `jabatan` != 'Marketing'

    public function getPermitToday()
    {
        $builder = $this->db->table('absensi');
        $builder->select('*');
        $builder->join('users', 'users.id = absensi.userid');
        $builder->where('tanggal', date('Y-m-d'));
        $builder->where('absensi.status', 'Izin');
        $query = $builder->get();
---
SELECT *
FROM `absensi`
JOIN `users` ON `users`.`id` = `absensi`.`userid`
WHERE `tanggal` = '2022-11-08'
AND `absensi`.`status` = 'Izin'

    public function countStatistic($min, $max)
    {
        $sql = "tanggal BETWEEN '$min' AND '$max'";
        $builder = $this->db->table('absensi');
        $builder->select('absensi.status as absenstatus');
        $builder->join('users', 'users.id = absensi.userid');
        $builder->where(new RawSql($sql));
        $builder->where('absensi.status !=', 'Kosong');
        $builder->where('absensi.status !=', 'Izin');
        $query = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `absensi`
JOIN `users` ON `users`.`id` = `absensi`.`userid`
WHERE tanggal BETWEEN '2022-01-01' AND '2022-01-31'
AND `absensi`.`status` != 'Kosong'
AND `absensi`.`status` != 'Izin'

    public function countAllStaffToday()
    {
        $builder = $this->db->table('absensi');
        $builder->select();
        $builder->where('jabatan !=', 'Marketing');
        $builder->where('absensi.status !=', 'Izin');
        $builder->where('tanggal', date('Y-m-d'));
        $builder->where('absensi.status !=', 'Libur');
        $builder->where('absensi.status !=', 'Kosong');
        $builder->where('absensi.status !=', 'Izin');
        $builder->join('users', 'users.id = absensi.userid');
        $query = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `absensi`
JOIN `users` ON `users`.`id` = `absensi`.`userid`
WHERE `jabatan` != 'Marketing'
AND `absensi`.`status` != 'Izin'
AND `tanggal` = '2022-11-08'
AND `absensi`.`status` != 'Libur'
AND `absensi`.`status` != 'Kosong'
AND `absensi`.`status` != 'Izin'

    public function countLateToday()
    {
        $builder = $this->db->table('absensi');
        $builder->select('absensi.status');
        $builder->where('jabatan !=', 'Marketing');
        $builder->where('absensi.status', 'Terlambat');
        $builder->where('tanggal', date('Y-m-d'));
        $builder->join('users', 'users.id = absensi.userid');
        $query = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `absensi`
JOIN `users` ON `users`.`id` = `absensi`.`userid`
WHERE `jabatan` != 'Marketing'
AND `absensi`.`status` = 'Terlambat'
AND `tanggal` = '2022-11-08'

    public function countPermitToday()
    {
        $builder = $this->db->table('absensi');
        $builder->select('absensi.status');
        $builder->where('jabatan !=', 'Marketing');
        $builder->where('absensi.status', 'Izin');
        $builder->where('tanggal', date('Y-m-d'));
        $builder->join('users', 'users.id = absensi.userid');
        $query = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `absensi`
JOIN `users` ON `users`.`id` = `absensi`.`userid`
WHERE `jabatan` != 'Marketing'
AND `absensi`.`status` = 'Izin'
AND `tanggal` = '2022-11-08'

    public function getStaffToday()
    {
        $builder = $this->db->table('absensi');
        $builder->select('*, absensi.status as absenstatus');
        $builder->where('jabatan !=', 'Marketing');
        $builder->where('tanggal', date('Y-m-d'));
        $builder->join('users', 'users.id = absensi.userid');
        $query = $builder->get();
---
SELECT *, `absensi`.`status` as `absenstatus`
FROM `absensi`
JOIN `users` ON `users`.`id` = `absensi`.`userid`
WHERE `jabatan` != 'Marketing'
AND `tanggal` = '2022-11-08'

    public function getMarketingToday()
    {
        $builder = $this->db->table('absensi');
        $builder->select('*, absensi.status as absenstatus');
        $builder->where('jabatan', 'Marketing');
        $builder->where('tanggal', date('Y-m-d'));
        $builder->join('users', 'users.id = absensi.userid');
        $query = $builder->get();
---
SELECT *, `absensi`.`status` as `absenstatus`
FROM `absensi`
JOIN `users` ON `users`.`id` = `absensi`.`userid`
WHERE `jabatan` = 'Marketing'
AND `tanggal` = '2022-11-08'

    public function getLast()
    {
        $builder = $this->db->table('absensi');
        $builder->selectMax('id');
        $builder->selectMin('checkout');
        $builder->where('userid', user()->id);
        $builder->where('tanggal', date('Y-m-d'));
        $query = $builder->get();
---
SELECT MAX(`id`) AS `id`, MIN(`checkout`) AS `checkout`
FROM `absensi`
WHERE `userid` = '2'
AND `tanggal` = '2022-11-08'